# 1 - рубль

# 2 - рубля
# 3 - рубля
# 4 - рубля

# НО есть один нюанс

# 11 - рублей
# 12 - рублей
# 13 - рублей
# 14 - рублей

# 5 - рублей
# 6 - рублей
# 7 - рублей
# 8 - рублей
# 9 - рублей
# 0 - рублей

# [0, 5, 6, 7, 8, 9] - рублей
# [2, 3, 4] - рубля
# [1] - рубль

def getRubles(num):
    
    group1 = [0, 5, 6, 7, 8, 9]
    group2 = [2, 3, 4]

    if (group1.count(num % 10) != 0 or num % 100 // 10 == 1):
        return f"{num} рублей"

    if (group2.count(num % 10) != 0):
        return f"{num} рубля"

    return f"{num} рубль"


for i in range (0, 31):
    print(getRubles(i))